SOAP/UpdateTransaction.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<bm:userInfo xmlns:bm="urn:soap.bigmachines.com">
			<bm:sessionId>SESSION_ID</bm:sessionId>
		</bm:userInfo>
		<bm:category xmlns:bm="urn:soap.bigmachines.com">Commerce</bm:category>
		<bm:xsdInfo xmlns:bm="urn:soap.bigmachines.com">
			<bm:schemaLocation>https://SITE_NAME.bigmachines.com/bmfsweb/SITE_NAME/schema/v1_0/commerce/PROCESS_VAR_NAME.xsd</bm:schemaLocation>
		</bm:xsdInfo>
	</soapenv:Header>
	<soapenv:Body>
		<bm:updateTransaction xmlns:bm="urn:soap.bigmachines.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<bm:transaction>
				<bm:id>TRANSACTION_ID</bm:id>
				<bm:process_var_name>PROCESS_VAR_NAME</bm:process_var_name>
				<bm:buyer_company_name>BUYER_COMPANY_NAME</bm:buyer_company_name>
				<bm:supplier_company_name>SUPPLIER_COMPANY_NAME</bm:supplier_company_name>
				<bm:data_xml>
					<bm:DOCUMENT_VAR_NAME_MAIN bm:bs_id="TRANSACTION_ID" bm:buyer_company_name="BUYER_COMPANY_NAME" bm:buyer_user_name="LOGIN_NAME" bm:data_type="0" bm:document_name="Quote" bm:document_number="1" bm:document_var_name="DOCUMENT_VAR_NAME_MAIN" bm:process_var_name="PROCESS_VAR_NAME" bm:supplier_company_name="SUPPLIER_COMPANY_NAME">
						<bm:sub_documents>LINE_PROCESS</bm:sub_documents>
					</bm:DOCUMENT_VAR_NAME_MAIN>
				</bm:data_xml>
				<bm:action_data>
					<bm:action_var_name>ACTION_VAR_NAME</bm:action_var_name>
					<bm:performer_name>LOGIN_NAME</bm:performer_name>
					<bm:performer_type>fullAccess</bm:performer_type>
					<bm:performer_company_name>BUYER_COMPANY_NAME</bm:performer_company_name>
				</bm:action_data>
			</bm:transaction>
		</bm:updateTransaction>
	</soapenv:Body>
</soapenv:Envelope>